Ran Plan for project: `demo-service` dir: `terraform/services/demo-service` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_db_parameter_group.aurora_mysql_57_parameter_group will be created
+ resource "aws_db_parameter_group" "aurora_mysql_57_parameter_group" {
      + arn         = (known after apply)
      + description = "Demo Service - Aurora Parameter Group for Mysql 5.7"
      + family      = "aurora-mysql5.7"
      + id          = (known after apply)
      + name        = "aurora-demo-service-mysql-57-parameter-group"
      + name_prefix = (known after apply)
    }

  # aws_rds_cluster_parameter_group.aurora_mysql_57_cluster_parameter_group will be created
+ resource "aws_rds_cluster_parameter_group" "aurora_mysql_57_cluster_parameter_group" {
      + arn         = (known after apply)
      + description = "Demo Service - Aurora Cluster Parameter Group for Mysql 5.7"
      + family      = "aurora-mysql5.7"
      + id          = (known after apply)
      + name        = "aurora-demo-service-mysql-57-cluster-parameter-group"
      + name_prefix = (known after apply)
    }

  # aws_route53_record.aurora_mysql_reader will be created
+ resource "aws_route53_record" "aurora_mysql_reader" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "aurora-mysql.reader"
      + records         = (known after apply)
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z00425511KNMOW9YGLJLL"
    }

  # aws_route53_record.aurora_mysql_writer will be created
+ resource "aws_route53_record" "aurora_mysql_writer" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "aurora-mysql.writer"
      + records         = (known after apply)
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z00425511KNMOW9YGLJLL"
    }

  # mysql_database.aurora_mysql["demo-service"] will be created
+ resource "mysql_database" "aurora_mysql" {
      + default_character_set = "utf8"
      + default_collation     = "utf8_general_ci"
      + id                    = (known after apply)
      + name                  = "demo-service"
    }

  # module.aurora_mysql.aws_db_subnet_group.this[0] will be created
+ resource "aws_db_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "For Aurora cluster aurora-demo-service-mysql"
      + id          = (known after apply)
      + name        = "aurora-demo-service-mysql"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-0139c4eb566a46bdd",
          + "subnet-096e31ab4adb28b50",
          + "subnet-0a5f92582b77fb184",
        ]
      + tags        = {
          + "Environment" = "demo"
          + "Name"        = "aurora-aurora-demo-service-mysql"
          + "Region"      = "eu"
          + "Service"     = "demo-service"
        }
    }

  # module.aurora_mysql.aws_rds_cluster.this will be created
+ resource "aws_rds_cluster" "this" {
      + apply_immediately                   = true
      + arn                                 = (known after apply)
      + availability_zones                  = (known after apply)
      + backtrack_window                    = 0
      + backup_retention_period             = 3
      + cluster_identifier                  = "aurora-demo-service-mysql"
      + cluster_identifier_prefix           = (known after apply)
      + cluster_members                     = (known after apply)
      + cluster_resource_id                 = (known after apply)
      + copy_tags_to_snapshot               = true
      + database_name                       = (known after apply)
      + db_cluster_parameter_group_name     = (known after apply)
      + db_subnet_group_name                = "aurora-demo-service-mysql"
      + deletion_protection                 = false
      + enable_http_endpoint                = false
      + endpoint                            = (known after apply)
      + engine                              = "aurora-mysql"
      + engine_mode                         = "provisioned"
      + engine_version                      = "5.7.12"
      + final_snapshot_identifier           = (known after apply)
      + hosted_zone_id                      = (known after apply)
      + iam_database_authentication_enabled = false
      + id                                  = (known after apply)
      + kms_key_id                          = (known after apply)
      + master_password                     = (sensitive value)
      + master_username                     = "root"
      + port                                = 3306
      + preferred_backup_window             = "02:00-03:00"
      + preferred_maintenance_window        = "sun:05:00-sun:06:00"
      + reader_endpoint                     = (known after apply)
      + skip_final_snapshot                 = true
      + storage_encrypted                   = true
      + tags                                = {
          + "Environment" = "demo"
          + "Region"      = "eu"
          + "Service"     = "demo-service"
        }
      + vpc_security_group_ids              = (known after apply)
    }

  # module.aurora_mysql.aws_rds_cluster_instance.this[0] will be created
+ resource "aws_rds_cluster_instance" "this" {
      + apply_immediately               = true
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = (known after apply)
      + ca_cert_identifier              = "rds-ca-2019"
      + cluster_identifier              = (known after apply)
      + copy_tags_to_snapshot           = false
      + db_parameter_group_name         = (known after apply)
      + db_subnet_group_name            = "aurora-demo-service-mysql"
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "aurora-mysql"
      + engine_version                  = "5.7.12"
      + id                              = (known after apply)
      + identifier                      = "aurora-demo-service-mysql-1"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.t3.medium"
      + kms_key_id                      = (known after apply)
      + monitoring_interval             = 0
      + monitoring_role_arn             = (known after apply)
      + performance_insights_enabled    = false
      + performance_insights_kms_key_id = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = "sun:05:00-sun:06:00"
      + promotion_tier                  = 1
      + publicly_accessible             = false
      + storage_encrypted               = (known after apply)
      + tags                            = {
          + "Environment" = "demo"
          + "Region"      = "eu"
          + "Service"     = "demo-service"
        }
      + writer                          = (known after apply)
    }

  # module.aurora_mysql.aws_security_group.this[0] will be created
+ resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "aurora-demo-service-mysql-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "demo"
          + "Name"        = "aurora-aurora-demo-service-mysql"
          + "Region"      = "eu"
          + "Service"     = "demo-service"
        }
      + vpc_id                 = "vpc-0346e33d0c03d90aa"
    }

  # module.aurora_mysql.aws_security_group_rule.cidr_ingress[0] will be created
+ resource "aws_security_group_rule" "cidr_ingress" {
      + cidr_blocks              = [
          + "10.100.0.0/16",
          + "10.50.0.0/16",
        ]
      + description              = "From allowed CIDRs"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.aurora_mysql.random_id.snapshot_identifier will be created
+ resource "random_id" "snapshot_identifier" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id" = "aurora-demo-service-mysql"
        }
    }

  # module.aurora_mysql.random_password.master_password will be created
+ resource "random_password" "master_password" {
      + id          = (known after apply)
      + length      = 10
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.mysql_users_for_aurora_mysql["demo-service"].mysql_grant.grants["demo-service"] will be created
+ resource "mysql_grant" "grants" {
      + database   = "demo-service"
      + grant      = false
      + host       = "%"
      + id         = (known after apply)
      + privileges = [
          + "DELETE",
          + "INSERT",
          + "SELECT",
          + "UPDATE",
        ]
      + table      = "*"
      + tls_option = "NONE"
      + user       = "demo-service"
    }

  # module.mysql_users_for_aurora_mysql["demo-service"].mysql_user.user will be created
+ resource "mysql_user" "user" {
      + host               = "%"
      + id                 = (known after apply)
      + plaintext_password = (sensitive value)
      + tls_option         = "NONE"
      + user               = "demo-service"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p demo-service`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.dh-nerddays-demo.com/lock?id=deliveryhero%252Fdh-nerddays-demo%252Fterraform%252Fservices%252Fdemo-service%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p demo-service`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
